app/controllers/properties_controller.rb

  def listings
    @properties = Property.where(:ME_TECH_ID => @agent_id).page params[:page]
---
SELECT COUNT(*) FROM `properties` WHERE `properties`.`ME_TECH_ID` = '20060909002923486441000000'
SELECT `properties`.* FROM `properties` WHERE `properties`.`ME_TECH_ID` = '20060909002923486441000000' LIMIT 5 OFFSET 0